{
  "backend/main.mo": "Main Motoko actor for KM Foods backend defining staff, attendance, and financial record management with role-based access control via MixinAuthorization. Exposes query and update functions for user profiles, staff CRUD, attendance sign-in/out, and financial records.",
  "feature_evidence.json": "Feature evidence report documenting the fix for the bug preventing new staff members from being added, linking the relevant frontend files (useQueries.ts, StaffManagement.tsx) and test ID REQ-11.",
  "frontend-file-summaries.txt": "JSON map of all frontend source files to short human-readable summaries, serving as a quick reference for the purpose and key changes in each file.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "HTML shell entry point that mounts the React app at #root and sets the browser tab title to 'KM Foods - Staff & Sales Manager'.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with four routes (Dashboard, Attendance, Sales, Staff) wrapped in AppLayout with a Toaster notification component.",
  "frontend/src/components/AppLayout.tsx": "Responsive app shell with a sticky dark header containing the KM Foods logo, desktop and mobile navigation links, a main content area, and a branded footer.",
  "frontend/src/components/RoleBadge.tsx": "Small presentational badge component that renders a styled pill for staff roles — gold for manager, charcoal for staff.",
  "frontend/src/components/ShiftBadge.tsx": "Small presentational badge component that renders a styled pill for shift types — amber for morning, red for evening, with emoji icons.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP actor, initializes access control with an admin token, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication hook and provider that manages AuthClient lifecycle, login/logout state, and exposes identity and status to the component tree via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for staff, attendance, and financial data, wrapping actor calls with useQuery and useMutation and invalidating relevant caches on success.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, sets up Tailwind directives, and defines CSS custom properties for a warm fast-food theme in both light and dark modes.",
  "frontend/src/lib/dateUtils.ts": "Utility functions for converting between JS Dates and ICP nanosecond bigints, formatting dates/times/currency, and generating unique staff IDs.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Attendance.tsx": "Attendance page that displays active staff for a selected date, allows filtering by shift, and supports recording sign-in (with shift selection) and sign-out actions.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard overview page showing today's attendance counts, sales totals, expenses, and active staff count with navigation shortcuts to Attendance and Sales pages.",
  "frontend/src/pages/SalesExpenses.tsx": "Sales and Expenses page with per-shift forms for cash sales, online sales, and expenses for a selected date, displaying a daily summary of total revenue, expenses, and net profit.",
  "frontend/src/pages/StaffManagement.tsx": "React page for managing staff members, allowing admins to add new staff (with name and role), search/filter active staff, and deactivate existing members, with toast notifications for feedback.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract URL parameters from both query strings and hash-based routing, persist them in sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark fast-food brand theme with charcoal, amber, gold, and red-accent color tokens, custom fonts, border radii, shadows, and accordion animations.",
  "project_state.json": "Project state metadata describing a burger outlet management app with features for staff management, attendance, sales/expenses, and a dashboard, noting a known issue with adding new staff members."
}